/*
    day09
    
    IDE Setting
        1. Eclipse IDE for Java Developers - 2020.06 버젼을 다운 받는다.
        2. 압축해제한다.
        3. ??\class\db\app 폴더 에 압축해제된 eclipse 폴더를 옮겨둔다.
        ４．　ｅｃｌｉｐｓｅ　를　실행시킨다．
        ５．　ｗｏｒｋｓｐａｃｅ　설정　창에서　경로를　ｃｌａｓｓ￦ｄｂ￦ｓｏｕｒｃｅ로　설정한다．
        ６．　ｗｉｎｄｏｗ　－－＞　ｓｈｏｗｖｉｅｗ　－－＞　ｏｒｔｈｅｒｓ　－－＞　Ｇｉｔ　－－＞　Ｇｉｔ　Ｒｅｐｏｓｉｔｏｒｙ
        
        ７．　ｇｉｔ　ｒｅｐｏｓｉｔｏｒｙ　창에　배경을　클릭하고
                깃허브　복사한　주소를　붙여넣기（ＣＴＲＬ　＋　Ｖ）　한다．
                
        ８．　추가할　때　로컬　저장경로　설정은
                ｃｌａｓｓ￦ｄｂ￦ｇｉｔ　폴더로　설정한다．
                
        ９．　저장소가　추가되면　트리를　펼쳐서
            　ｗｏｒｋｉｎｇ　ｔｒｅｅ　를　펼치고　
             ．ｇｉｔ폴더　아래에　있는　프로젝트　폴더를　선택한　후
             마우스오른쪽　버튼을　클릭하고
             ｉｍｐｏｒｔ　Ｐｒｏｊｅｃｔｓ　메뉴를　선택한다．
             
        １０．　작업　인코딩　설정은
                ｗｉｎｄｏｗ　－－＞　Ｐｒｅｐｅｒｅｎｃｅｓ　메뉴를　선택하고
                창의　오른쪽　상단의　ｇｅｎｅｒａｌ　메뉴를　펼치면
                맨　하단에　ｗｏｒｋｓｐａｃｅ　메뉴를　선택한다
                Ｔｅｘｔ　ｆｉｌｅ　ｅｎｃｏｄｉｎｇ　항목을　찾아서
                인코딩　방식을　ＵＴＦ８로　선택하고　
                ａｐｐｌｙ　버튼을　클릭한다．
                
        １１．　ｈｅｌｐ　메뉴를　클릭하고
                마켓플레이스　를　선택해서
                ｓｑｌ을　입력해서　검색하고
                ｓｑｌ　ｅｄｉｔｏｒ　을　찾아서　설치해준다．
                
                
                
    https://github.com/increpas-cls2/11gxe
    
--------------------------------------------------------------------------------------------------------------------------
코딩용 폰트 설치하기

consolas - 코딩용 폰트(영문)

d2coding        - 한글 영문 모두 처리해주는 폰트
나눔고딕코딩      - 이것도 설치하시면 좋습니다...

*/


select * from emp;

INSERT INTO
    comp(empno, ename)
VALUES(
    NULL, '마이콜'
);

----------------------------------------------------------------------------
/*
    DDL(Data Definition Language) 명령
    ==> 개체(테이블, 계정, 제약, 뷰, 프로그램, 함수, ...)를 다루는 명령
        ==> 실행하는 순간 데이터베이스에 적용이 된다.
            따라서
            이전에 실행했던 DML 명령이 있다면
            이 명령으로 인해서 데이터베이스에 적용이 된다.
*/

UPDATE
    comp
SET
    job = '모델'
WHERE
    empno = 7938
;

CREATE TABLE
    comp2
AS
    SELECT
        *
    FROM
        emp
;

UPDATE
    comp
SET
    job = NULL
WHERE
    empno = 7938
;

DROP TABLE comp2;

---------------------------------------------------------------------------------------------------------
/*
    참고 ]
        테이블 설계
            오라클은 정규화된 데이터를 기억하도록 하는 데이터베이스의 일종이다.
            
            정규화 데이터란??
            규칙(규격)이 정해진 데이터를 말한다.
            즉, 오라클은 어떤 데이터를 기억할지를 미리 정해놓고
            그 데이터에 한해서만 기억하도록 하는 데이터베이스이다.
            
            따라서 테이블을 만들때는 여러가지 규칙을 가지고(정규화 규칙)
            데이블에 들어갈 데이터를 결정해야 한다.
            
            종류 ]
                논리적 설계
                ==> 개념스키마
                    필요한 테이블을 정리하는 것.
                    어떤 개체의 어떤 속성들을 저장할것인지.
                    개체와 개체의 관계
                    개체의 속성들의 제약조건...
                    
                결과물 ]
                    ER Model    - 개체의 속성과 개체간의 관계를 다이어 그램으로 작성한 것.
                    ER Diagram  - ER Model 에서 도출된 속성들과 개체들의 관계를 
                                  표 형식으로 작성한 것.
                                  
                    ==> 두가지를 합쳐서 ERD 라 부른다.
                    
                물리적 설계
                ==> 논리적 설계를 바탕으로 나온 결과(개념스키마)를 
                    데이터베이스에 물리적으로 적용되도록 만들어 내는것.
                    
                    개체의 이름, 개체가 가지는 속성들의 물리적 이름(컬럼이름 또는 필드이름),
                    속성의 타입, 사이즈 등이 정의 된다.
                    
                    ==> 테이블 명세서, DDL 명령
                            테이블 명세서에는 실제 디스크에 기록될 테이블이름, 속성이름, 데이터 타입, 사이즈, 제약조건등이 정확하게 기술이 된다.
*/












