/*
    다음 문제들을 해결할 뷰를 만들어서 처리하세요.
    
    v01 이라는 뷰를 만들어서 처리..
    
    문제 1 ]
        회사 평균 급여보다 급여를 적게 받는 사원들의
            사원이름, 급여, 회사평균급여
        를 조회하세요.
        
    문제 2 ]
        회사 최고 급여자의 
            사원번호, 사원이름, 직급, 부서이름, 급여, 회사최고급여
        를 조회하세요.
    
 ----------------------------------------------------------------------   
    -- v02 라는 뷰를 만들어서 처리하세요.  
    문제 3 ]
        급여를 가장 많이 받는 부서의 부서워들의
            사원이름, 직급, 급여, 부서이름, 부서급여합계
        를 조회하세요.
        
    문제 4 ]
        부서 평균급여보다 급여를 많이 받는 사원들의
            사원이름, 급여, 급여등급, 부서이름, 부서평균급여
        를 조회하세요.
        
    문제 5 ]
        부서원수가 가장 많은 부서의 사원중 부서평균급여보다
        급여를 적게 받는 사원들의
            사원이름, 직급, 급여, 부서이름, 부서평균급여, 부서원수
        를 조회하세요.
*/